"""
if [条件语句]：
   [ 执行语句]
   [执行语句]
eles：
   [执行语句]
   [执行语句]
"""


# mood_index = int(input("刘美琳的心情指数是："))
# if mood_index >= 60:
#     print("很好 今天是个好日子")
# else:# mood_index < 60
#    print("感觉睡觉")
# #



#给女儿的
yuefen = int(input("输入你的生日月份:"))
if 321 <= yuefen <= 419:
    print("""     白羊座
     今日提醒
感受时间紧迫性

      综合运势
运势稍有回升，但幅度较小，一般难以察觉。
感受不到时间的紧迫性，建议置身于竞争的氛围中，
有利于鞭策你加把劲往前冲，应该要定一个目标的。
生活方面对待家人比较不上心，但最将你放在心尖上的就是他们了。
      爱情运势
单身的自我感觉良好，容易表错情。恋爱中的在约会时别总是顾着低头看手机。
      财富运势
收入比较稳定，足以应付日常的花销，建议在吃喝玩乐方面可以适度控制，多存点钱。
      工作运势
会以追赶的姿势在前行，目标感明确，只是过程需要个人进行突破与进步。
      """)
elif 420 <= yuefen <= 520:
    print("""      金牛座
     今日提醒
  旁敲侧击出误会
      综合运势
整体运势还可以，建议保持充分的沟通，避免误会的出现。
有很多涉及沟通方面的事情，如果旁敲侧击很容易栽跟头，
建议直接沟通。生活方面会有很多朋友的邀请，建议根据自己的心意选择，
如果想把时间留给自己，那就委婉拒绝。
      爱情运势
单身的对感情较迟钝，get不到爱情的信号。恋爱中的偶尔也可以配合恋人多一点仪式感。
      财富运势
一般般的财运，你在求财方面还是相对保守的姿态，没有理财的进账，需省吃俭用些。
      工作运势
决定好的事情不要随便改动，尤其是计划的开展会带来很大的影响，建议谨慎行事。
      """)
elif 521 <= yuefen <= 621:
    print("""     双子座(5.21-6.21)
    今日提醒
计划赶不上变化
      综合运势
整体运势并不乐观，偶尔出现起伏不定的情况。
计划没能赶上变化，所以很多时候都要跳出原地计划进行重新的部署
，考验应变的能力。生活方面容易在期待中消磨热情，
计划可能会被放鸽子，建议别寄托在不确定的因素上。
      爱情运势
单身的感受到同龄人的压力，脱单有心无力。
恋爱中的尽量与恋人一起行动，别把对方晾一边。
      财富运势
破财的危机比较多，务必小心应对，
一些看起来稳赚的高回报项目很可能是坑，别贪得无厌了。
      工作运势
保持全力以赴的姿态，主动出击的势头很猛，
行动比较大胆，而且还能越战越勇。
    """)

elif 622 <= yuefen <= 722:
    print("""     巨蟹座(6.22-7.22)
    今日提醒
满足于舒适圈中
      综合运势
整体运势下跌，导致有些措手不及的状况。
你可能还满足在自己的舒适圈中，没有预料到一些小危机的靠近，
容易让你陷入困局。待人过度热情，会容易成为人们口中的“烂好人”，
若是好心帮了倒忙更是吃力不讨好。
      爱情运势
单身的对脱单感觉有心无力，略感疲惫。恋爱中的为恋人操碎心，对方却不领情。
      财富运势
容易满足固定收入的进账，花钱上比较省吃俭用，距离实现财富自由还远着呢。
      工作运势
你缺少了未雨绸缪的能力，导致总是等到问题出现的时候才会匆匆忙忙去恶补。
      """)
elif 723 <= yuefen <= 822:
    print("""      狮子座(7.23-8.22)
    今日提醒
有勇无谋缺计划
      综合运势
整体运势略显低迷，越是自信的地方越容易大意。
你比较随心所欲地行动，很多时候能大胆进行尝试，
但却可能会是有勇无谋，欠缺计划性。生活方面切勿自信过度，
容易给人自大的印象，也会带来为人处事的问题。
      爱情运势
单身的热情适度收一收，免得给对方压力。恋爱中的会有长辈催婚压力，要和恋人一起面对。
      财富运势
会有冲动消费的情况，尤其是对兴趣爱好或是电子产品特别容易心动，建议理性花钱。
      工作运势
要摒除墨守成规的做事方式，只有打破常规才能迎来突破，否则会总感觉怀才不遇
      """)
elif 823 <= yuefen <= 922:
    print("""      处女座(8.23-9.22)
      今日提醒
  藏着软弱的一面
      综合运势
整体运势中规中矩，你特别害怕在人前暴露自己软弱的一面。
正因如此你总是会逞强，会是比较辛苦的一天。生活方面比较容易傲娇，
不想别人猜透自己真实的想法而故意说反话，
但也会有抱怨别人不理解自己的情况。
      爱情运势
单身的心防过高，没有给别人了解你的机会。恋爱中的不要一味发脾气，要学会互相包容理解。
      财富运势
一般般的财运，想要得到进账不容易，而且还要兼顾日常的花销，建议养成记账的习惯。
      工作运势
建议不要把麻烦事揽上身，尤其是别人的烂摊子，你需要集中注意力解决手头的问题。
      """)
elif 923 <= yuefen <= 1023:
    print("""    天秤座(9.23-10.23)
      今日提醒
学会控制情绪是关键。
      综合运势
整体运势较差，越是屈服越容易陷入两难的格局，
建议奋起反抗。问题很多，但并非处理不了，
只是要加点信心与毅力。生活方面建议安排更有意义的节目，
不要浑浑噩噩地追剧或是葛优躺，之后会悔恨浪费了时间。
      爱情运势
单身的在喜欢的人面前容易害羞，需要朋友助攻。恋爱中的别怕给恋人负担，要一起面对问题。
       财富运势
经济略显拮据，需要用钱时方恨少，可能会与别人有借贷的来往，建议远离老赖。
      工作运势
考验会接踵而来，很容易出现应顾不暇的情况，建议打醒精神应对，别轻易言败。
      """)
elif 1024 <= yuefen <= 1122:
    print("""      天蝎座(10.24-11.22)
    今日提醒
走上小小的捷径
      综合运势
运气在线的一天，机灵与聪明将会用得恰到好处。
而且贵人运也相当给力，能让你走上小小的捷径，还能迎来难得的机会。
生活方面得到爱豆或是其他能量的鼓舞，
你会在新改变中不断尝试突破，目标是成为更好的自己。
      爱情运势
单身的桃花运中好坏参半，注意带眼识人。
恋爱中的桃花运太旺，反而会容易动摇现有恋情。
      财富运势
收入可观，无论是投资理财还是存钱
，都容易如愿以偿，而且还能满足生活的享受。
       工作运势
找到适合自己的方法，你能够机智地随机应变，
总是容易扭转为对自己有利的“战场”。
      """)
elif 1123 <= yuefen <= 1221:
    print("""      射手座(11.23-12.21)
      """)
elif 1222 <= yuefen <= 1231:
    print("""      摩羯座(12.22-1.19)
    今日提醒
自己就是主宰
      综合运势
整体运势很好，你就是自己主宰的一天。
自由安排的时间比较宽裕，建议做好充实的安排，
尽量别让自己闲下来，高效利用运气的助力。
生活方面对新奇的事物比较感兴趣，也可以到高评价的网红店打卡，会给你新鲜感。
      爱情运势
单身的多出门走动，更容易有浪漫的邂逅。
恋爱中的加点新鲜元素，利于促进感情升温。
      财富运势
投资理财容易收获惊喜，眼光比较不错，
小试牛刀也能带来意想不到的进账。
      工作运势
主动安排自主的计划，也容易得到旁人的帮助，
能在少兜圈子的情况下向目标迈进。
      """)
elif 11 <= yuefen <= 119:
    print("""      摩羯座(12.22-1.19)
     今日提醒
自己就是主宰
      综合运势
整体运势很好，你就是自己主宰的一天。
自由安排的时间比较宽裕，建议做好充实的安排，
尽量别让自己闲下来，高效利用运气的助力。
生活方面对新奇的事物比较感兴趣，也可以到高评价的网红店打卡，会给你新鲜感。
      爱情运势
单身的多出门走动，更容易有浪漫的邂逅。
恋爱中的加点新鲜元素，利于促进感情升温。
      财富运势
投资理财容易收获惊喜，眼光比较不错，
小试牛刀也能带来意想不到的进账。
      工作运势
主动安排自主的计划，也容易得到旁人的帮助，
能在少兜圈子的情况下向目标迈进。
      """)
elif 120 <= yuefen <= 218:
    print("""      水瓶座(1.20-2.18)
      今日提醒
乘胜追击的势头
      综合运势
整体运势简直就是开挂的节奏，正是乘胜追击的势头。
只要你加以努力，便容易如愿以偿，而且还能得到来自贵人以及运气的鼓舞。
生活方面与人沟通时保持清晰的逻辑思维，
别被对方牵着鼻子走，尽量自己把握主导权。
      爱情运势
单身的会有一拍即合的爱情火花。恋爱中的与恋人有着一致的三观，默契度更高。
      财富运势
嗅觉特别灵敏的一天，对求财信息总是能第一手掌握，并且通过形势分析赢得进账机会。
      工作运势
精神振奋的一天，你有着满满的雄心壮志，会在行动上表现出来，相当的亮眼。
      """)
elif 219 <= yuefen <= 320:
    print("""      双鱼座(2.19-3.20)
      今日提醒
保持独立的姿态
      综合运势
有心想事成的运气，主动走在时间的前面。
为人处事的方式很加分，总是容易得到助攻，
而且也能保持独立的姿态。生活方面周边的人际关系会给你很大的帮助，
而且也能结交到志趣相投的朋友。
      爱情运势
单身的保持热情更容易打动喜欢的人。
恋爱中的可以通过穿情侣衫或情侣用品低调秀恩爱。
      财富运势
能做好个人收支的把关，你能看着钱包花钱，
没有超出消费水平，也可以进行自我投资。
      工作运势
能够通过听取不同的建议改进行动，
表现出肉眼可见的进步，更容易得到大家的支持。
      """)


else:
    print("输入错误，已关机！！！")